Revit 2024 API
ParameterDownloadOptions Members
The ParameterDownloadOptions type exposes the following members.
Constructors
Name | Description
ParameterDownloadOptions()
 Default constructor.
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId)
 Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
Methods
Name | Description
Dispose
Releases all resources used by the ParameterDownloadOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCategories
 Get categories for binding.
GetGroupTypeId
 Get properties palette group identifier.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCategories
 Set categories for binding.
SetGroupTypeId
 Set properties palette group identifier.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsInstance
 True if binding to Element instances, false if binding to Element types.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Visible
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace